Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/different_legal_ways_of_getting_married.html.txt.tmx
Source language: en
Languages: ga

source: Different legal ways of getting married
ga: Bealaí dlíthiúla difriúla le bheith pósta

source: Once you are sure that you have the capacity to marry you can decide how you wish to marry in Ireland
ga: Nuair atá tú cinnte go bhfuil cumas pósta agat, is féidir leat cinneadh a dhéanamh cén chaoi ar mhaith leat pósadh in Éirinn

source: You may choose a civil Registry Office marriage or opt for marriage by religious or secular ceremony
ga: D'fhéadfá pósadh sibhialta in Oifig Chláraithe a roghnú nó pósadh trí shearmanas saolta nó reiligiúnach

source: Marriages that take place in Ireland by certain specified religious or secular ceremonies or by civil ceremony (that is, in a Registry Office or other approved place) are equally valid and binding under Irish law
ga: Tá póstaí a tharlaíonn in Éirinn trí shearmanais reiligiúnacha n saolta sonraithe nó trí shearmanas sibhialta (is é sin, in Oifig Chláraithe nó áit cheadaithe eile) chomh bailí céanna agus ceangailteach de réir dlí na hÉireann

source: Whether you decide on a religious, secular or civil ceremony you will require a Marriage Registration Form which you obtain by fulfilling the notification requirements
ga: Má chinneann tú searmanas reiligiúnach, saolta nó sibhialta a bheith agat, beidh Foirm Chláraithe Pósta de dhíth ort, a aimseoidh tú trí na riachtanais fógartha a chomhlíonadh

source: Please note that this section deals only with the legal requirements for a legally valid marriage
ga: Sonraigh le do thoil go ndéileálann an rannóg seo le riachtanais dhlíthiúla amháin maidir le pósadh atá bailí de réir dlí

source: If you are marrying through a religious or secular ceremony then you should discuss their requirements with the celebrant of your marriage
ga: Má tá tú ag pósadh trí shearmanas reiligiúnach nó saolta, ba chóir duit a gcuid riachtanais a phlé le ceiliúraí an phósta agat

source: The following procedures apply to anyone getting married in Ireland, whether you are an Irish citizen or a foreign national
ga: Baineann na nósanna imeachta a leanas le duine ar bith atá ag pósadh in Éirinn, cibé an saoránach na hÉireann nó náisiúnach coigríche atá i gceist

source: If you are getting married by civil ceremony in a Registry Office or other approved place, you should approach the Registrar of Civil Marriages for the district in which you intend to marry for information on how to proceed
ga: Má tá tú ag pósadh in Éirinn trí shearmanas sibhialta in Oifig Chláraithe nó áit cheadaithe eile, ba chóir duit teagmháil a dhéanamh le Cláraitheoir na bPóstaí Sibhialta don dúiche ina bhfuil sí beartaithe agat pósadh, chun faisnéis a fháil maidir leis an gceist a bhogadh ar aghaidh

source: If you are getting married by religious or secular ceremony, you should approach the authorities of the body concerned for advice on how to proceed
ga: Má tá tú ag pósadh trí shearmanas saolta nó reiligiúnach, ba chóir duit teagmháil a dhéanamh le húdaráis an comhlacht lena mbaineann, chun comhairle a fháil maidir leis an gceist a bhogadh ar aghaidh

source: Since November 2007, the General Register Office maintains a Register of Solemnisers of Marriage (pdf) and anyone solemnising a civil, secular or religious marriage must be on the Register
ga: Ón Samhain 2007, déanann An tSeirbhís um Chlárú Sibhialta Clár Sollúnóirí an Phósta (pdf) a choinneáil, agus caithfidh duine ar bith atá ina shollúnaí de phósadh sibhialta, saolta nó reiligiúnach a bheith ar an gClár

source: The Register can be inspected at any Registration Office
ga: Is féidir an Clár a scrúdú in Oifig Chláraithe ar bith

source: A marriage that is legally binding may be celebrated in Ireland in a civil ceremony, in a secular ceremony or in a religious ceremony which is also recognised by civil law as being a civil contract
ga: Is féidir pósadh atá ceangailteach de réir dlí a cheiliúradh in Éirinn, i searmanas sibhialta, saolta nó reiligiúnach, atá aitheanta de réir an dlí sibhialta chomh maith mar chonradh sibhialta

source: The appropriateness of the venue you choose for a religious or secular marriage ceremony is the responsibility of the body under whose auspices the marriage is being performed
ga: Tá an foras a bhfuil an pósadh faoina gcoimirce freagrach as feiliúnacht an ionaid a roghnaíonn tú do shearmanas reiligiúnach nó saolta an phósta

source: Civil marriage ceremonies are held in a Registry Office or, since November 2007, in any venue, providing the venue has been approved by the Registrar
ga: Déantar searmanais an phósta sibhialta a thionól in Oifig Chláraithe nó, ón Samhain 2007, in ionad ar bith, chomh fada agus a bhfuil an t-ionad ceadaithe ag an gCláraitheoir

source: You need to contact the Registrar to arrange to have the venue inspected
ga: Caithfidh tú teagmháil a dhéanamh leis an gCláraitheoir ionas gur féidir an t-ionad a scrúdú

source: Renewing your wedding vows
ga: Do mhóideanna pósta a athnuachan

source: Under the law in Ireland, someone who is already married cannot get married again (even if it is to the same person)
ga: De réir dlí in Éirinn, ní féidir le duine pósadh in athuair má tá siad cheana féin pósta (fiú amháin más don duine céanna é)

source: This effectively means that you cannot renew your wedding vows in a civil ceremony in Ireland
ga: Ciallaíonn sé seo nach féidir leat i bhfírinne, do mhóideanna pósta a athnuachan i searmanas sibhialta in Éirinn

source: However, there is a long tradition of "church blessings" in Ireland
ga: Cibé ar bith, tá traidisiún fada de "bheannachtaí Eaglaise" in Éirinn

source: This is where Irish people who have married in civil ceremonies abroad, marry in a religious ceremony the next time they are home
ga: Tarlaíonn sé seo nuair a bhíonn daoine Éireannacha pósta i searmanais shibhialta thar lear, agus bíonn siad pósta i searmanas reiligiúnach an chéad uair eile a fhilleann siad ar an mbaile

source: Sometimes, people living in Ireland have their marriage blessed in a religious ceremony, to commemorate a special anniversary or event
ga: Uaireanta, faigheann daoine atá cónaí in Éirinn an pósadh beannaithe i searmanas reiligiúnach, mar chomóradh ar cheiliúradh nó imeacht speisialta

source: Contact an appropriate local clergyman who should be able to put you in touch with a counterpart in Ireland
ga: Déan teagmháil le duine oiriúnach áitiúil den chléir, agus ba chóir go mbeidís ábalta tú a chur i dteagmháil le comhghleacaí in Éirinn

source: If you live in Ireland and would like to have your marriage blessed, you should get in touch with your local clergyman
ga: Má chónaíonn tú in Éirinn agus más maith leat do phósadh a bheith beannaithe, ba chóir duit teagmháil a dhéanamh le duine den chléir áitiúil
